lyplcr/ehal/arch/msp430/msp430f21x1/dev/gpio1.h
#ifndef GPIO1_H
#define GPIO1_H
#include <stdint.h>
#include <core/ehal.h>
#include <msp430.h>

static inline void gpio1_ctor(void)
{ /* nothing to do, it starts powered up. */
}

static inline void gpio1_dtor(void)
{
}

static inline void gpio1_set_in(uint8_t pins)
{
	P2DIR &= ~pins;
}

static inline void gpio1_set_out(uint8_t pins)
{
	P2DIR |= pins;
}

static inline void gpio1_set_dir(uint8_t pins, uint8_t in)
{
	bm_apply(P2DIR, pins,~in);
}

static inline uint8_t gpio1_read(void)
{
	return P2IN;
}

static inline void gpio1_set(uint8_t pins)
{
	P2OUT |= pins;
}

static inline void gpio1_clr(uint8_t pins)
{
	P2OUT &=~pins;
}

static inline void gpio1_set_to(uint8_t pins, uint8_t values)
{
	bm_apply(P2OUT, pins, values);
}

static inline void gpio1_set_pullup(uint8_t pins)
{
	P2REN |= pins;
	P2OUT |= pins;
}

static inline void gpio1_clr_pullup(uint8_t pins)
{
	P2REN &=~pins;
}

static inline void gpio1_set_pulldown(uint8_t pins)
{
	P2REN |= pins;
	P2OUT &=~pins;
}

static inline void gpio1_clr_pulldown(uint8_t pins)
{
	P2REN &=~pins;
}

static inline void gpio1_set_edge_irq(uint8_t pins, uint8_t rise)
{
	P2IE |= pins;
	bm_apply(P2IES, pins, rise);
}

#endif /* GPIO1_H */
